{
  "arxiv_id": "2510.01889v1",
  "title": "Small is Sufficient: Reducing the World AI Energy Consumption Through\n  Model Selection",
  "summary": "The energy consumption and carbon footprint of Artificial Intelligence (AI)\nhave become critical concerns due to rising costs and environmental impacts. In\nresponse, a new trend in green AI is emerging, shifting from the \"bigger is\nbetter\" paradigm, which prioritizes large models, to \"small is sufficient\",\nemphasizing energy sobriety through smaller, more efficient models.\n  We explore how the AI community can adopt energy sobriety today by focusing\non model selection during inference. Model selection consists of choosing the\nmost appropriate model for a given task, a simple and readily applicable\nmethod, unlike approaches requiring new hardware or architectures. Our\nhypothesis is that, as in many industrial activities, marginal utility gains\ndecrease with increasing model size. Thus, applying model selection can\nsignificantly reduce energy consumption while maintaining good utility for AI\ninference.\n  We conduct a systematic study of AI tasks, analyzing their popularity, model\nsize, and efficiency. We examine how the maturity of different tasks and model\nadoption patterns impact the achievable energy savings, ranging from 1% to 98%\nfor different tasks. Our estimates indicate that applying model selection could\nreduce AI energy consumption by 27.8%, saving 31.9 TWh worldwide in 2025 -\nequivalent to the annual output of five nuclear power reactors.",
  "authors": [
    "Tiago da Silva Barros",
    "Frédéric Giroire",
    "Ramon Aparicio-Pardo",
    "Joanna Moulierac"
  ],
  "published": "2025-10-02T10:58:13Z",
  "primary_category": "cs.CY",
  "arxiv_url": "https://arxiv.org/abs/2510.01889v1",
  "primary_area": "text_models",
  "secondary_focus": "model_compression",
  "application_domain": "general_purpose",
  "tldr_zh": "本文提出通过模型选择策略实现绿色AI，从'越大越好'转向'小而足'范式。研究表明，针对不同任务选择合适的模型规模，可在保持性能的同时显著降低能耗，预计2025年全球可节约31.9TWh电力，相当于5座核电站年发电量。",
  "order": 65,
  "papers_cool_url": "https://papers.cool/arxiv/2510.01889v1"
}