{
  "arxiv_id": "2510.00495v2",
  "title": "Normal-Abnormal Guided Generalist Anomaly Detection",
  "summary": "Generalist Anomaly Detection (GAD) aims to train a unified model on an\noriginal domain that can detect anomalies in new target domains. Previous GAD\nmethods primarily use only normal samples as references, overlooking the\nvaluable information contained in anomalous samples that are often available in\nreal-world scenarios. To address this limitation, we propose a more practical\napproach: normal-abnormal-guided generalist anomaly detection, which leverages\nboth normal and anomalous samples as references to guide anomaly detection\nacross diverse domains. We introduce the Normal-Abnormal Generalist Learning\n(NAGL) framework, consisting of two key components: Residual Mining (RM) and\nAnomaly Feature Learning (AFL). RM extracts abnormal patterns from\nnormal-abnormal reference residuals to establish transferable anomaly\nrepresentations, while AFL adaptively learns anomaly features in query images\nthrough residual mapping to identify instance-aware anomalies. Our approach\neffectively utilizes both normal and anomalous references for more accurate and\nefficient cross-domain anomaly detection. Extensive experiments across multiple\nbenchmarks demonstrate that our method significantly outperforms existing GAD\napproaches. This work represents the first to adopt a mixture of normal and\nabnormal samples as references in generalist anomaly detection. The code and\ndatasets are available at https://github.com/JasonKyng/NAGL.",
  "authors": [
    "Yuexin Wang",
    "Xiaolei Wang",
    "Yizheng Gong",
    "Jimin Xiao"
  ],
  "published": "2025-10-01T04:27:10Z",
  "primary_category": "cs.CV",
  "arxiv_url": "https://arxiv.org/abs/2510.00495v2",
  "primary_area": "video_models",
  "secondary_focus": "model_architecture",
  "application_domain": "general_purpose",
  "tldr_zh": "本文提出一种实用的通用异常检测方法NAGL，首次同时利用正常和异常样本作为参考，通过残差挖掘和异常特征学习组件，实现跨域异常检测的显著性能提升。",
  "order": 673,
  "papers_cool_url": "https://papers.cool/arxiv/2510.00495v2"
}