{
  "arxiv_id": "2510.01398v1",
  "title": "Automating Data-Driven Modeling and Analysis for Engineering\n  Applications using Large Language Model Agents",
  "summary": "Modern engineering increasingly relies on vast datasets generated by\nexperiments and simulations, driving a growing demand for efficient, reliable,\nand broadly applicable modeling strategies. There is also heightened interest\nin developing data-driven approaches, particularly neural network models, for\neffective prediction and analysis of scientific datasets. Traditional\ndata-driven methods frequently involve extensive manual intervention, limiting\ntheir ability to scale effectively and generalize to diverse applications. In\nthis study, we propose an innovative pipeline utilizing Large Language Model\n(LLM) agents to automate data-driven modeling and analysis, with a particular\nemphasis on regression tasks. We evaluate two LLM-agent frameworks: a\nmulti-agent system featuring specialized collaborative agents, and a\nsingle-agent system based on the Reasoning and Acting (ReAct) paradigm. Both\nframeworks autonomously handle data preprocessing, neural network development,\ntraining, hyperparameter optimization, and uncertainty quantification (UQ). We\nvalidate our approach using a critical heat flux (CHF) prediction benchmark,\ninvolving approximately 25,000 experimental data points from the OECD/NEA\nbenchmark dataset. Results indicate that our LLM-agent-developed model\nsurpasses traditional CHF lookup tables and delivers predictive accuracy and UQ\non par with state-of-the-art Bayesian optimized deep neural network models\ndeveloped by human experts. These outcomes underscore the significant potential\nof LLM-based agents to automate complex engineering modeling tasks, greatly\nreducing human workload while meeting or exceeding existing standards of\npredictive performance.",
  "authors": [
    "Yang Liu",
    "Zaid Abulawi",
    "Abhiram Garimidi",
    "Doyeong Lim"
  ],
  "published": "2025-10-01T19:28:35Z",
  "primary_category": "cs.AI",
  "arxiv_url": "https://arxiv.org/abs/2510.01398v1",
  "primary_area": "text_models",
  "secondary_focus": "reasoning",
  "application_domain": "general_purpose",
  "tldr_zh": "本研究提出利用大语言模型代理自动化数据驱动建模与分析的新方法，重点针对回归任务。通过多代理协作系统和单代理ReAct框架，实现了从数据预处理到神经网络开发、训练、超参数优化及不确定性量化的全流程自动化。在临界热通量预测基准测试中，该方法性能超越传统查表法，达到与专家开发的贝叶斯优化深度神经网络相当的预测精度，展示了LLM代理在复杂工程建模任务中的巨大潜力。",
  "order": 161,
  "papers_cool_url": "https://papers.cool/arxiv/2510.01398v1"
}